{
  "backend/main.mo": "Main backend canister implementing access control, user profiles, subscriber and package management, billing structures, and admin/user‑restricted queries and mutations.",
  "backend/migration.mo": "Defines a placeholder migration module that returns an empty new actor state.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the role and functionality of each frontend file.",
  "frontend/index.css": "Global Tailwind and OKLCH theme configuration with light/dark variables and RTL-compatible base styles.",
  "frontend/index.html": "HTML entry point configured for Arabic language and RTL layout, loading the React app root.",
  "frontend/src/App.tsx": "Main React application coordinating auth, profile setup, subscriber login flow, role‑based navigation, and page rendering.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an admin‑only access denied message using card and alert UI components.",
  "frontend/src/components/auth/AuthGate.tsx": "Login screen prompting unauthenticated users to sign in via Internet Identity with Arabic RTL UI.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth state with cache clearing and Arabic labels.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal component that collects name and phone from the user and saves the profile via a mutation.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user’s Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provider and hook for managing Internet Identity login state, storing identity, and exposing login/clear functions.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, admin state, packages, billing, and subscriber data via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark themes, global styles, and RTL adjustments.",
  "frontend/src/lib/money.ts": "Utility functions for formatting USD amounts and converting numbers to bigint.",
  "frontend/src/lib/phone.ts": "Utility functions for sanitizing, validating, formatting Iraqi phone numbers, and generating validation messages.",
  "frontend/src/lib/placeholderPhone.ts": "Detects backend-generated placeholder phone numbers by pattern.",
  "frontend/src/lib/whatsapp.ts": "Utility functions for validating, sanitizing, and constructing WhatsApp URLs and opening chats.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/BillingPage.tsx": "Billing page that lets admins select month/year and displays subscriber billing data with loading and error states.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the dashboard with month/year selectors, placeholder billing stats, and an info alert indicating backend data is not yet implemented.",
  "frontend/src/pages/MyDuesPage.tsx": "Displays the logged-in user's monthly dues with date selectors, error handling, and data fetched via useGetCallerMonthlyDue.",
  "frontend/src/pages/OwnerOperationsPage.tsx": "Provides navigation cards for owner functions including dashboard, subscribers, and billing management.",
  "frontend/src/pages/SubscriberLoginPage.tsx": "Implements subscriber login via phone number validation and claiming the subscriber record through useClaimSubscriber.",
  "frontend/src/pages/SubscribersPage.tsx": "Allows admins to manage subscribers including bulk import, adding single subscribers, and deleting all subscribers with related dialogs.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing/retrieving them in sessionStorage, and cleaning parameters from hash-based routes.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, fonts, animations, and plugin setup.",
  "project_state.json": "JSON file describing the project state, existing features, and new feature requests for subscriber phone-number login."
}