{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, package management, subscribers, and monthly billing state.",
  "feature_evidence.json": "Feature evidence report listing Arabic localization, RTL support, and month-name localization with associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables, dark mode tokens, and base resets.",
  "frontend/index.html": "HTML entry point configured for Arabic language and RTL direction with root mount and script loader.",
  "frontend/src/App.tsx": "Main app component handling authentication flow, profile setup, header, navigation, and page routing with Arabic UI.",
  "frontend/src/components/auth/AuthGate.tsx": "Login screen prompting unauthenticated users with Arabic text and Internet Identity login button.",
  "frontend/src/components/auth/LoginButton.tsx": "Auth button handling login/logout with error recovery and Arabic labels.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting first‑time users to save name and phone with Arabic labels and validation.",
  "frontend/src/hooks/useActor.ts": "React Query hook creating an actor tied to Internet Identity and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login state, identity loading, and error handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on user profiles, packages, subscribers, and billing data through the actor interface.",
  "frontend/src/index.css": "Tailwind CSS configuration with light and dark theme variables plus RTL and utility styles.",
  "frontend/src/lib/money.ts": "Utility functions for formatting USD currency values and converting numbers to bigint.",
  "frontend/src/lib/whatsapp.ts": "Includes helpers to validate, sanitize, and open WhatsApp phone links.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, and the Internet Identity provider.",
  "frontend/src/pages/BillingPage.tsx": "Billing management UI showing subscribers, package prices, and monthly due/paid toggles with backend updates.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard that displays monthly and yearly billing totals with selectable date filters.",
  "frontend/src/pages/SubscribersPage.tsx": "React page for listing, searching, creating, and editing subscribers with dialog-based forms and integration with subscriber/package APIs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters, including hash-routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and plugin setup for the frontend.",
  "project_state.json": "Project metadata describing the Arabic localization initiative, existing features, and pending requirements."
}