{
  "backend/main.mo": "Motoko backend actor implementing access control, user profiles, package management, and subscriber/billing data structures with admin/user permissions.",
  "feature_evidence.json": "Feature evidence report listing required frontend changes, associated files, and feature metadata for bulk delete and admin UI updates.",
  "frontend-file-summaries.txt": "Prewritten summaries for multiple frontend files describing their purpose and functionality.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color tokens, RTL adjustments, and light/dark theme variables.",
  "frontend/index.html": "HTML entry point configured for Arabic language and RTL layout with root container and script loader.",
  "frontend/src/App.tsx": "Main React app handling authentication, profile setup, header/navigation, and routing between dashboard, subscribers, and billing pages.",
  "frontend/src/components/auth/AuthGate.tsx": "Login screen prompting unauthenticated users to authenticate using Internet Identity.",
  "frontend/src/components/auth/LoginButton.tsx": "Reusable login/logout button that triggers Internet Identity authentication and clears React Query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting first-time users to save their profile with name and phone before accessing the app.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching the backend actor using the current identity and reinitializing access control when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity React context providing identity state, login, logout, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, admin checks, packages, bulk subscriber import, and deleting subscribers.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark color themes, utilities, and RTL adjustments.",
  "frontend/src/lib/money.ts": "Provides helpers for formatting USD amounts and converting numbers to bigint.",
  "frontend/src/lib/placeholderPhone.ts": "Detects backend-generated placeholder phone numbers using a simple prefix check.",
  "frontend/src/lib/whatsapp.ts": "Validates, sanitizes, and generates WhatsApp URLs and provides a function to open chats.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/BillingPage.tsx": "Renders a billing UI with month/year filters and placeholder content pending backend implementation.",
  "frontend/src/pages/DashboardPage.tsx": "Displays a dashboard with date selectors and static billing stats awaiting backend support.",
  "frontend/src/pages/SubscribersPage.tsx": "Manages subscribers with bulk import, deletion, package selection, and admin checks using backend mutations.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL or hash parameters and persisting them in sessionStorage, plus helpers to clear stored or hash-based params.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, colors, fonts, animations, and plugins like typography and container queries.",
  "project_state.json": "Metadata describing project state, existing features, and pending feature requests for the bulk subscriber deletion project."
}