{
  "backend/main.mo": "Motoko backend actor implementing access control, user profiles, package management, subscribers, and billing data structures with admin-protected mutations.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs for traceability.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file for documentation or build planning.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH colors, theme variables, and RTL-friendly base styling.",
  "frontend/index.html": "HTML entry point configuring Arabic language, RTL direction, and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main React component handling authentication flow, profile setup, and navigation between dashboard, subscribers, and billing pages.",
  "frontend/src/components/auth/AuthGate.tsx": "Login gate UI prompting unauthenticated users to sign in via Internet Identity.",
  "frontend/src/components/auth/LoginButton.tsx": "Header login/logout button integrating Internet Identity with query cache reset.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first‑time users to submit name and phone before accessing the app.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching the authenticated backend actor and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, identity loading, and state management. Includes helpers for creating an AuthClient and accessing identity status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, admin status, packages, subscriber imports, deletions, and monthly billing via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind CSS layers and defines light/dark theme variables, global styles, and RTL adjustments.",
  "frontend/src/lib/money.ts": "Utility functions for formatting amounts as USD and converting numbers to bigint for backend use.",
  "frontend/src/lib/placeholderPhone.ts": "Provides a helper to detect backend-generated placeholder phone numbers.",
  "frontend/src/lib/whatsapp.ts": "Functions to validate, sanitize, and format WhatsApp phone numbers, including opening chats via wa.me URLs.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, and the Internet Identity provider.",
  "frontend/src/pages/BillingPage.tsx": "UI page for selecting a month and year and displaying subscriber billing data, including loading and error states.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page showing date selectors and placeholder billing stats pending backend implementation.",
  "frontend/src/pages/SubscribersPage.tsx": "Implements subscriber management UI with bulk import, deletion, and package selection using React and custom hooks. Handles dialogs, form state, and API mutations with success/error toasts.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from URL hashes. Supports both query and hash-based routing.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, animations, and plugins including typography, container queries, and animate. Extends UI tokens with custom OKLCH variables.",
  "project_state.json": "Tracks project metadata, versions, features, and pending feature requests for subscriber billing functionality. Defines current state and requirements for upcoming work."
}