{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, packages, subscribers, and monthly billing state with admin/user permissions.",
  "feature_evidence.json": "Metadata linking implemented features to source files, components, and test IDs for traceability.",
  "frontend-file-summaries.txt": "Prewritten summaries describing frontend React files, hooks, utilities, pages, and styling configuration.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React app and setting the page title.",
  "frontend/src/App.tsx": "Main React component handling authentication, profile setup, navigation, and page rendering.",
  "frontend/src/components/auth/AuthGate.tsx": "Login screen shown to unauthenticated users using Internet Identity authentication.",
  "frontend/src/components/auth/LoginButton.tsx": "Header login/logout button integrating Internet Identity and clearing query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting first-time users to enter name and phone number and save their profile.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, packages, subscribers, and billing data through the actor.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables for colors and UI styling.",
  "frontend/src/lib/money.ts": "Utility functions to format USD currency and convert numbers to bigint.",
  "frontend/src/lib/whatsapp.ts": "Validates, sanitizes, and opens WhatsApp phone URLs via wa.me links.",
  "frontend/src/main.tsx": "App entry point that mounts React, wrapping the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BillingPage.tsx": "Billing UI for viewing subscribers, selecting dates, and toggling monthly paid/due statuses.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing monthly and yearly due totals with date selectors and summary cards.",
  "frontend/src/pages/SubscribersPage.tsx": "React page for listing, searching, adding, editing, and managing subscribers including WhatsApp actions and package assignment.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata defining features, requirements, architecture notes, and pending feature requests for the accounting app."
}