{
  "kind": "build_request",
  "title": "Show subscriber name with amount owed for March in Monthly Billing",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend query API that returns, for a given (year, month), a list of active subscribers with their full name and the amount owed for that month, computed from the subscriber's package price.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "الاسم مع  المبلغ عليه شهر مارس"
        ]
      },
      "acceptanceCriteria": [
        "A new Motoko query method exists in backend/main.mo that accepts (year: Nat, month: Nat).",
        "The method returns an array of entries containing at minimum: subscriberId, fullName, and amountUsd (Nat).",
        "For each entry, amountUsd equals the subscriber's package priceUsd (from globalPackages) when the subscriber is active and the subscriptionStartDate is on or before the requested month/year; otherwise the subscriber is omitted (or amountUsd is 0, but behavior must be consistent and documented in code comments).",
        "If a subscriber's packageId is missing from globalPackages, the entry is safely skipped or returns amountUsd = 0 (no trap).",
        "The method is admin-only (consistent with other subscriber-management operations), and traps with an Unauthorized message for non-admin callers."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Expose the new backend monthly-amounts query in the frontend React Query data layer as a typed hook, and ensure cache keys are parameterized by year and month.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "الاسم مع  المبلغ عليه شهر مارس"
        ]
      },
      "acceptanceCriteria": [
        "A new hook is added in frontend/src/hooks/useQueries.ts that calls the new backend query and returns the result via useQuery.",
        "The queryKey includes both selectedYear and selectedMonth (e.g., ['billing','month',year,month]) so changing filters refetches correctly.",
        "The hook handles the 'actor not available' case consistently with existing hooks (no crashes)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Monthly Billing page to display a table/list for the selected month/year that shows each subscriber's name and the amount owed, and ensure March (month=3) works when selected.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "الاسم مع  المبلغ عليه شهر مارس"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/pages/BillingPage.tsx uses the new React Query hook to fetch billing entries for (selectedYear, selectedMonth).",
        "The page renders a visible list/table with at least two columns: Subscriber Name and Amount Owed (formatted as USD using existing money formatting helpers).",
        "When the user selects March (value 3), the results shown correspond to month=3 queries.",
        "Loading state shows a skeleton (or equivalent) while the billing query is fetching.",
        "Error state shows an alert with English user-facing text describing that billing data could not be loaded.",
        "The previous placeholder message indicating billing is unavailable is removed or replaced so the page no longer claims backend support is missing once the feature is implemented."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if a stable-state upgrade is required.",
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths (compose components instead)."
  ],
  "nonGoals": [
    "Implementing full billing lifecycle management (marking months paid/unpaid, editing per-subscriber billing status) beyond computing and displaying the amount owed.",
    "Adding third-party authentication or external database/storage.",
    "Changing app language/RTL layout globally."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}