{
  "kind": "build_request",
  "title": "Full Arabic localization (RTL) across the accounting app UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Translate all user-visible UI text in the frontend to Arabic across the entire app, including authentication screens, navigation, pages (Dashboard, Subscribers, Monthly Billing), dialogs, form labels/placeholders, table headers, empty states, button labels, and toast notifications.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "كامل في اللغة العربية"
        ]
      },
      "acceptanceCriteria": [
        "All currently English UI strings in these files are replaced with Arabic equivalents: frontend/src/App.tsx, frontend/src/components/auth/AuthGate.tsx, frontend/src/components/auth/LoginButton.tsx, frontend/src/components/auth/ProfileSetupModal.tsx, frontend/src/pages/DashboardPage.tsx, frontend/src/pages/SubscribersPage.tsx, frontend/src/pages/BillingPage.tsx.",
        "All toast messages shown via sonner are displayed in Arabic (e.g., validation errors, success/failure states).",
        "No mixed-language labels remain in navigation tabs, headings, descriptions, table headers, dialog titles/descriptions, form labels, placeholders, and action button text."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add right-to-left (RTL) layout support for Arabic, including setting the document language/direction appropriately and ensuring main app layouts (header, nav, forms, tables, dialogs) render correctly in RTL.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "كامل في اللغة العربية"
        ]
      },
      "acceptanceCriteria": [
        "The root HTML document is updated so the app is configured for Arabic (e.g., lang=\"ar\") and RTL direction (e.g., dir=\"rtl\") without breaking React mounting.",
        "Primary layout areas (header, top navigation, page sections, dialogs) visually align and flow RTL; spacing/icons do not overlap text and remain readable.",
        "Form inputs, placeholders, and table content remain usable and visually consistent in RTL (no clipped labels, misaligned controls, or broken modal layouts)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Localize month names and any date-related labels shown in month/year selectors and billing headings to Arabic.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "كامل في اللغة العربية"
        ]
      },
      "acceptanceCriteria": [
        "Month selector options in Dashboard and Monthly Billing pages display Arabic month names instead of English (replacing the current MONTHS label values).",
        "The Monthly Billing card title (e.g., \"Billing for ...\") and similar date-context labels on the Dashboard page are displayed in Arabic."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files in frontend/src/components/ui (these paths are immutable).",
    "Keep the backend as a single Motoko actor in backend/main.mo; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Adding new business features (e.g., new billing flows, invoices generation, reporting modules) beyond translating/localizing the existing UI.",
    "Changing backend data models or stored data solely for localization purposes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}