{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin-only bulk delete all subscribers (frontend wiring)",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add a React Query mutation hook to call deleteAllSubscribers() and invalidate subscribers, billing, and totals queries.",
      "acceptanceCriteria": [
        "A new React Query mutation hook exists in frontend/src/hooks/useQueries.ts for deleting all subscribers.",
        "On successful mutation, the subscribers list refetches and displays no rows.",
        "On successful mutation, totals and billing-dependent UI refetches (no stale totals).",
        "Errors from the backend are surfaced to the caller as a rejected mutation (so the UI can toast/display the error)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query mutation hook (e.g., useDeleteAllSubscribers) that calls actor.deleteAllSubscribers() (per frontend/src/backend.d.ts) and, on success, invalidates queries for ['subscribers'], all ['billing', *] queries (via queryKey prefix ['billing']), and all ['totals', *] queries (via queryKey prefix ['totals']). Ensure errors are not swallowed so callers receive a rejected mutation for UI handling. Verify the authorization component's frontend usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add an admin-only 'Delete all subscribers' control on SubscribersPage with irreversible confirmation and pending/success/error UX.",
      "acceptanceCriteria": [
        "When logged in as an admin, a 'Delete all subscribers' action is available on the Subscribers page (frontend/src/pages/SubscribersPage.tsx).",
        "When logged in as a non-admin, the delete-all action is not shown.",
        "Clicking the action opens a confirmation dialog; cancelling closes the dialog without changes.",
        "Confirming triggers the delete-all mutation and disables the confirm button while pending.",
        "On success, the subscribers table shows the empty state, and a success toast/message is shown.",
        "On failure (including Unauthorized), an error toast/message is shown and no UI state is incorrectly cleared client-side."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SubscribersPage.tsx",
          "operation": "modify",
          "description": "Wire an admin-only 'Delete all subscribers' action into the existing header actions area (near Bulk Import) using the existing useIsCallerAdmin guard so non-admins never see it. Add local state to control a confirmation Dialog (using existing shadcn/ui Dialog primitives already imported) that clearly warns the action is irreversible and will delete subscribers and billing data. On confirm, call the new useDeleteAllSubscribers mutation; disable the confirm button while mutation is pending; on success, show a toast including the deleted count returned by the backend and close the dialog; on error (including Unauthorized), show an error toast and do not clear UI state manually (rely on query invalidation/refetch). Verify the shadcn-ui component usage instructions before implementing, and verify the authorization component's frontend usage instructions before implementing."
        }
      ]
    }
  ]
}