{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Monthly Billing: show subscriber name and amount owed per selected month",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add a typed React Query hook that fetches monthly billing amounts for a given year/month with a parameterized cache key.",
      "acceptanceCriteria": [
        "A new hook is added in frontend/src/hooks/useQueries.ts that calls the new backend query and returns the result via useQuery.",
        "The queryKey includes both selectedYear and selectedMonth (e.g., ['billing','month',year,month]) so changing filters refetches correctly.",
        "The hook handles the 'actor not available' case consistently with existing hooks (no crashes)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new typed React Query hook (e.g., useFetchMonthlyBills / useMonthlyBills) that calls the backend monthly billing query (per backend interface) and returns results via useQuery. Ensure the queryKey is parameterized as ['billing','month',year,month]. Mirror existing actor-availability handling (e.g., enabled gating on actor + returning safe defaults when actor is missing) to avoid crashes."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update the Monthly Billing page to fetch and render a name + amount owed list/table for the selected month/year, with loading and error states.",
      "acceptanceCriteria": [
        "frontend/src/pages/BillingPage.tsx uses the new React Query hook to fetch billing entries for (selectedYear, selectedMonth).",
        "The page renders a visible list/table with at least two columns: Subscriber Name and Amount Owed (formatted as USD using existing money formatting helpers).",
        "When the user selects March (value 3), the results shown correspond to month=3 queries.",
        "Loading state shows a skeleton (or equivalent) while the billing query is fetching.",
        "Error state shows an alert with English user-facing text describing that billing data could not be loaded.",
        "The previous placeholder message indicating billing is unavailable is removed or replaced so the page no longer claims backend support is missing once the feature is implemented."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BillingPage.tsx",
          "operation": "modify",
          "description": "Wire the new monthly billing hook into the page, passing selectedYear/selectedMonth so March (3) triggers month=3 queries. Replace the current 'billing unavailable / backend missing' placeholder alert and empty-state copy with: (1) Skeleton-based loading UI while the billing query is fetching, (2) an error <Alert> with English text when the query fails, and (3) a visible table/list rendering billing entries with columns 'Subscriber Name' and 'Amount Owed'. Use the existing frontend/src/lib/money.ts formatUSD helper to format the owed amount as USD."
        }
      ]
    }
  ]
}