{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Full Arabic localization (RTL) across the accounting app UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Translate all user-visible UI text across the authenticated app shell, authentication screens, pages, dialogs, forms, tables, empty states, buttons, and toast notifications into Arabic.",
      "acceptanceCriteria": [
        "All currently English UI strings in these files are replaced with Arabic equivalents: frontend/src/App.tsx, frontend/src/components/auth/AuthGate.tsx, frontend/src/components/auth/LoginButton.tsx, frontend/src/components/auth/ProfileSetupModal.tsx, frontend/src/pages/DashboardPage.tsx, frontend/src/pages/SubscribersPage.tsx, frontend/src/pages/BillingPage.tsx.",
        "All toast messages shown via sonner are displayed in Arabic (e.g., validation errors, success/failure states).",
        "No mixed-language labels remain in navigation tabs, headings, descriptions, table headers, dialog titles/descriptions, form labels, placeholders, and action button text."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Replace all user-visible strings in the app shell (navigation tab labels, header/footer text, any descriptions) with Arabic equivalents; ensure any inline text (including footer copy) is fully Arabic."
        },
        {
          "path": "frontend/src/components/auth/AuthGate.tsx",
          "operation": "modify",
          "description": "Translate all unauthenticated screen text (title/description, helper paragraph, button label, and loading label) into Arabic."
        },
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "Translate login/logout button labels and loading text into Arabic while preserving existing authentication behavior."
        },
        {
          "path": "frontend/src/components/auth/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Translate modal title/description, form labels/placeholders, submit button labels, and all sonner toast messages into Arabic; avoid surfacing raw error.message in toasts if it may appear in English, and instead show Arabic failure messages while logging the original error to console."
        },
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Translate all headings, descriptions, card titles, explanatory copy, and any labels into Arabic; ensure any UI text displayed in cards and selectors is Arabic."
        },
        {
          "path": "frontend/src/pages/SubscribersPage.tsx",
          "operation": "modify",
          "description": "Translate all page text: headings/descriptions, button labels, search placeholder, empty states, table headers, badge labels, action titles/tooltips, dialog title/description, form labels/placeholders, helper text, dialog footer buttons, and all sonner toast messages into Arabic; avoid showing raw error.message in toasts if it may be English."
        },
        {
          "path": "frontend/src/pages/BillingPage.tsx",
          "operation": "modify",
          "description": "Translate all page text: headings/descriptions, card title/description, empty state, table headers, status badges, and all sonner toast messages into Arabic; avoid showing raw error.message in toasts if it may be English."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Enable RTL layout support for Arabic by setting document lang/dir and adjusting key layout and alignment details so header/nav/forms/tables/dialogs remain usable in RTL.",
      "acceptanceCriteria": [
        "The root HTML document is updated so the app is configured for Arabic (e.g., lang=\"ar\") and RTL direction (e.g., dir=\"rtl\") without breaking React mounting.",
        "Primary layout areas (header, top navigation, page sections, dialogs) visually align and flow RTL; spacing/icons do not overlap text and remain readable.",
        "Form inputs, placeholders, and table content remain usable and visually consistent in RTL (no clipped labels, misaligned controls, or broken modal layouts)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Set the root HTML document language to Arabic and direction to RTL (update the <html> tag to use lang=\"ar\" and dir=\"rtl\") while keeping React mounting intact."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add RTL-friendly global styling adjustments scoped to the RTL document direction (e.g., ensure text-align/direction defaults are consistent, and apply any safe, minimal overrides to keep form controls/tables/modals readable in RTL) without changing any immutable UI component files."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust header/nav layout spacing for RTL where needed (e.g., icon/text spacing classes) so navigation buttons render correctly without overlap in RTL."
        },
        {
          "path": "frontend/src/components/auth/AuthGate.tsx",
          "operation": "modify",
          "description": "Update icon/text spacing in the login call-to-action for RTL (e.g., replace left-to-right margin utilities around icons with RTL-appropriate spacing) to keep alignment correct."
        },
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "Update icon/text spacing for RTL (e.g., replace mr-2 with ml-2 where appropriate) so the button content reads naturally in RTL."
        },
        {
          "path": "frontend/src/pages/SubscribersPage.tsx",
          "operation": "modify",
          "description": "Fix RTL alignment issues for key UI elements (e.g., search icon positioning and input padding, action button icon spacing, and any right/left alignment utilities) so forms and tables remain usable in RTL."
        },
        {
          "path": "frontend/src/pages/BillingPage.tsx",
          "operation": "modify",
          "description": "Ensure RTL usability in the billing table rows and toggles by adjusting any directional spacing/alignment utilities as needed so labels, switches, and status badges remain readable and aligned in RTL."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Localize month names and date-context labels in month/year selectors and billing/dashboard headings into Arabic.",
      "acceptanceCriteria": [
        "Month selector options in Dashboard and Monthly Billing pages display Arabic month names instead of English (replacing the current MONTHS label values).",
        "The Monthly Billing card title (e.g., \"Billing for ...\") and similar date-context labels on the Dashboard page are displayed in Arabic."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Replace the MONTHS labels with Arabic month names and update date-context UI strings (e.g., the month/year caption under monthly totals and any 'Total for ...' copy) to Arabic."
        },
        {
          "path": "frontend/src/pages/BillingPage.tsx",
          "operation": "modify",
          "description": "Replace the MONTHS labels with Arabic month names and translate the billing heading/title that references the selected month/year (e.g., 'Billing for ...') into Arabic."
        }
      ]
    }
  ]
}